import asyncio


import random
from AnonX import app
from pyrogram.types import (InlineKeyboardButton,
                            InlineKeyboardMarkup, Message)
from strings.filters import command
from pyrogram import filters, Client
import config



txt = [

    "**- اسرع واحد يدز العكس** ~ ( بارده)",
  
    "**- اسرع واحد يدز العكس** ~ ( اجيت)",
  
    "**- اسرع واحد يدز العكس*ذ ~ ( جبان)",
  
    "**- اسرع واحد يدز العكس** ~ ( مافهمت)",
  
    "**- اسرع واحد يدز العكس** ~ ( ميت)",
  
    "**- اسرع واحد يدز العكس** ~ ( وصخ)",
    
    "**- اسرع واحد يدز العكس** ~ ( جوعان)",
  
    "**- اسرع واحد يدز العكس** ~ ( زين)",
  
    "**- اسرع واحد يدز العكس** ~ ( قوي)",
  
    "**- اسرع واحد يدز العكس** ~ ( بطيء)",
  
    "**- اسرع واحد يدز العكس** ~ ( ذكي)",
  
    "**- اسرع واحد يدز العكس** ~ ( خائف)",
  
    "**- اسرع واحد يدز العكس** ~ ( حزين)",
  
    "**- اسرع واحد يدز العكس** ~ ( مستمتع)",
  
    "**- اسرع واحد يدز العكس** ~ ( فرحان)",
  
    "**- اسرع واحد يدز العكس** ~ ( ذو شخصية قوية)",
  
    "**- اسرع واحد يدز العكس** ~ ( واثق)",
  
    "**- اسرع واحد يدز العكس** ~ ( متوتر)",
  
    "**- اسرع واحد يدز العكس** ~ ( مندهش)",
  
    "**- اسرع واحد يدز العكس** ~ ( فائق الذكاء)",
  
    "**- اسرع واحد يدز العكس** ~ ( ذكي للغاية)",
  
    "**- اسرع واحد يدز العكس** ~ ( متسرع)",
  
    "**- اسرع واحد يدز العكس** ~ ( متفائل)",
  
    "**- اسرع واحد يدز العكس** ~ ( متشائم)",
  
    "**- اسرع واحد يدز العكس** ~ ( متفائل جداً)",
  
    "**- اسرع واحد يدز العكس** ~ ( مكتئب)",
  
    "**- اسرع واحد يدز العكس** ~ ( مبتهج)",
  
    "**- اسرع واحد يدز العكس** ~ ( مغمض العينين)",
  
    "**- اسرع واحد يدز العكس** ~ ( مستنكر)",
  
    "**- اسرع واحد يدز العكس** ~ ( مرتبك)",
  
    "**- اسرع واحد يدز العكس** ~ ( متحمس)",
  
    "**- اسرع واحد يدز العكس** ~ ( متعب)",
  
    "**- اسرع واحد يدز العكس** ~ ( مفاجأ)",
  
    "**- اسرع واحد يدز العكس** ~ ( محبوب)",
  
    "**- اسرع واحد يدز العكس** ~ ( مكره)",
  
    "**- اسرع واحد يدز العكس** ~ ( معجب)",
  
    "**- اسرع واحد يدز العكس** ~ ( متواضع)",
  
    "**- اسرع واحد يدز العكس** ~ ( متكبر)",
  
    "**- اسرع واحد يدز العكس** ~ ( متفائل جداً)",
  
    "**- اسرع واحد يدز العكس** ~ ( محبوب للغاية)",
  
    "**- اسرع واحد يدز العكس** ~ ( معفن)",
  
    "**- اسرع واحد يدز العكس** ~ ( محترم)",
  
    "**- اسرع واحد يدز العكس** ~ ( مشاغب)",
  
    "**- اسرع واحد يدز العكس** ~ ( متسلط)",
  
    "**- اسرع واحد يدز العكس** ~ ( متواضع جداً)",
  
    "**- اسرع واحد يدز العكس** ~ ( متهور)",
  
    "**- اسرع واحد يدز العكس** ~ ( مبتكر)",
  
    "**- اسرع واحد يدز العكس** ~ ( ملهم)",
  
    "**- اسرع واحد يدز العكس** ~ ( مضحك)",
  
    "**- اسرع واحد يدز العكس** ~ ( مكتئب جداً)",
  
    "**- اسرع واحد يدز العكس** ~ ( مهتم)",
  
    "**- اسرع واحد يدز العكس** ~ ( محطم)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالحياة)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالحماس)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالتفاؤل)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالسعادة)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالحزن)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالرغبة)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالحب)",

    "**- اسرع واحد يدز العكس** ~ ( مليء بالحنان)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالكراهية)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالامتنان)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالرضا)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالخيبة)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالحزن)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالفرح)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالندم)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالنجاح)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالفشل)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالتحدي)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالحكمة)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالجنون)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالسكون",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالحركة)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالفكاهة)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالعقلانية)",
  
    "**- اسرع واحد يدز العكس** ~ ( مليء بالجمال)",



        ]





@app.on_message(command(["العكس","", ""]))


async def cutt(client: Client, message: Message):


      a = random.choice(txt)


      await message.reply(


        f"{a}")
